[
  {
    "title": "Website UniãoES",
    "description": "<p>Portal Web criado no para receber doações de colaboradores neste momento de pandemia que o mundo está passando.<br />Possui upload de marcas e portal da transparência.</p>",
    "techs": ["Node.js", "React.js", "TypeScript", "MongoDB"],
    "image": "portal-uniaoes.png"
  },
  {
    "title": "Demonstrativo de Resultado - DRE",
    "description": "<p>Script que cruza dados de várias tabelas de um banco de dados,aplica várias regras de negócios e financeiras para poder gerar um relatório semanal para os gestores da empresa.</p><p>No email é enviado o resultado atual do mês corrente, todas as despesas em hierarquia, checklist de lançamentos, relatórios para auditoria e detalhamento do resultado e despesas por cliente e por parceiro.</p><p>O script ainda gera alertas automaticos caso haja prejuizo em algum setor.</p>",
    "techs": ["Node.js", "Amazon SES", "Microsoft SQL"],
    "image": "iconex-dre-email.png"
  },
  {
    "title": "iConex Entrega - Aplicativo Mobile",
    "description": "<p>Aplicativo Offline First, armazena todos os dados no aparelho, e faz a sincronização em background via API REST. Controla toda a unidade operacional da iConex Logística.</p>",
    "techs": ["Node.js", "React Native", "Microsoft SQL"],
    "image": "mobile-iconex-entrega.png"
  },
  {
    "title": "Script - Integração - Tracking",
    "description": "<p>Toda empresa logística precisa enviar todos os dados de movimentações dos pedidos para os seus respectivos clientes (contratantes).</p><p>E o grande problema é que cada cliente possue um formato diferente para receber essa informação, então acaba gastando muito tempo de desenvolvimento</p><p>Para resolver esse problema, eu desenvolvi um software integrador. Basta configurarmos um novo cliente nele (processo dura 2 minutos), e após isso o software irá se adequar ao formato e ao método de envio do cliente <strong>automagicamente</strong>.</p><strong>Tipo de arquivos suportados</strong><ul><li>EDI</li><li>JSON</li><li>XML</li><li>CSV</li></ul><strong>Tipo de envios suportados</strong><ul><li>API</li><li>Webservice</li><li>E-Mail</li><li>FTP</li></ul>",
    "techs": ["Node.js", "MongoDB", "Microsoft SQL", "Handlebars"]
  },
  {
    "title": "Website - Role em Lux",
    "description": "<p>Website criado para uma empresa da Europa, devendo ter 3 idiomas, sendo eles o <strong> português, inglês e francês</strong>.</p>",
    "techs": ["Node.js", "React.js", "Adonis.js", "Postgres"],
    "image": "website-roleemlux.png"
  },
  {
    "title": "iConex Cliente",
    "description": "<p>Portal Web que gerencia todos os pedidos de um determinado cliente expedidor. Garante total visibilidade com uma grande simplicidade em todos os processos.</p>",
    "techs": ["Node.js", "HTML5", "CSS3", "jQuery", "Microsoft SQL"],
    "image": "iconex-portal-do-cliente.png"
  },
  {
    "title": "ONEX - Módulo Operacional",
    "description": "<p>Programa responsável por fazer a triagem, separação e emissão de pedidos que chegam no Centro de Distribuição da iConex Logística.</p><p>Todos os pedidos devem passar por este sistema, onde recebem um ID e uma etiqueta, que seja usado até o fim de todo o processo logístico.</p>",
    "techs": ["Java", "Node.js", "Microsoft SQL"],
    "image": "onex-operacional-java-check.png"
  },
  {
    "title": "TCC - SOSCAR",
    "description": "<p>Aplicativo para pedir socorro quando algo acontecer com seu veículo, independente do que seja.</p><p>Link para visualização: <a href='https://www.behance.net/gallery/91457847/iConex-Entrega' target='_blank' >Abrir Behance</a><p>",
    "techs": ["Node.js", "React Native", "MongoDB"]
  },
  {
    "title": "UI - Aplicativo de E-commerce",
    "description": "<p>UI de um aplicativo mobile para vendar online. O cenário escolhido foi o de vinhos.</p><p>Link para visualização: <a href='https://www.behance.net/gallery/91457151/Ecommerce-APP' target='_blank' >Abrir Behance</a></p>",
    "techs": ["Invision Studio"]
  },
  {
    "title": "UI - Aplicativo de limpeza",
    "description": "<p>UI de um aplicativo mobile para limpeza de veículos, projeto pensado em facilitar a forma de lavar carros.</p><p>Link para visualização: <a href='https://www.behance.net/gallery/91456719/Lavae' target='_blank' >Abrir Behance</a></p>",
    "techs": ["Invision Studio"]
  }
]